In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.095824 -2.019289
1  X   beta  2.395418 -1.071926
2  Y  alpha -0.787340 -0.311501
3  Y   beta  1.122253  0.604263
4  Z  alpha  0.076890 -1.245093

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [4]:
group1.mean()

k1
X    1.745621
Y    0.167457
Z    0.076890
Name: dataset1, dtype: float64

In [5]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [6]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    2.395418
    JAN   -0.787340
NY  FEB    1.122253
    JAN    0.586357
Name: dataset1, dtype: float64

In [8]:
dframe.groupby('k1').mean(numeric_only=True)

    dataset1  dataset2
k1
X   1.745621 -1.545607
Y   0.167457  0.146381
Z   0.076890 -1.245093

In [9]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.095824 -2.019289
   beta   2.395418 -1.071926
Y  alpha -0.787340 -0.311501
   beta   1.122253  0.604263
Z  alpha  0.076890 -1.245093

In [10]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [ ]:
for name,group in dframe.groupby('k1'):
  print(f"This is the {name} group")
  print(group,'\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  1.095824 -2.019289
1  X   beta  2.395418 -1.071926

This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.787340 -0.311501
3  Y   beta  1.122253  0.604263

This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha   0.07689 -1.245093

In [16]:
for (k1, k2),group in dframe.groupby(['k1','k2']):
  print(f"Key1 = {k1} Key2 = {k2}")
  print(group,'\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  1.095824 -2.019289

Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  2.395418 -1.071926

Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  -0.78734 -0.311501

Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  1.122253  0.604263

Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha   0.07689 -1.245093

In [17]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  1.095824 -2.019289
1  X   beta  2.395418 -1.071926

In [19]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1

/var/folders/rp/r7rm8rzn5mvdkpykf4c15d540000gn/T/ipykernel_5495/3680648569.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

{dtype('float64'):    dataset1  dataset2
 0  1.095824 -2.019289
 1  2.395418 -1.071926
 2 -0.787340 -0.311501
 3  1.122253  0.604263
 4  0.076890 -1.245093,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [21]:
dataset2_group = dframe['dataset2'].groupby([dframe['k1'], dframe['k2']])
dataset2_group.mean()

k1  k2
X   alpha   -2.019289
    beta    -1.071926
Y   alpha   -0.311501
    beta     0.604263
Z   alpha   -1.245093
Name: dataset2, dtype: float64